/*
У вас есть два варианта задач:

1)Добавить пять интерфейсов к классам из ДЗ 1, включающих все концепции, упомянутые на семинаре. включающих:
- интерфейсы,
- константы,
- default методы,
- перегрузки и переопределения методов.Вы можете выбрать любой класс из ДЗ 1 и добавить к нему интерфейсы. Вам также предоставляется возможность добавить новые методы или использовать уже существующие методы в классе.

2)Реализовать класс Market и все его обязательные методы. Этот класс должен реализовывать методы из интерфейса QueueBehaviour, которые имитируют работу очереди. Кроме того, класс должен содержать методы, соответствующие интерфейсу MarketBehaviour, которые добавляют и удаляют людей из очереди, а также метод update, который обновляет состояние магазина путем принятия и отдачи заказов.

Для сдачи задания необходимо предоставить ссылку на проект в GitHub.

Пожалуйста, выберите одну из этих задач, с которой вы хотите продолжить, и уточните, какой именно класс вы выбрали для задачи 1, если решаете ее.

 */


public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}